In [48]:
import pandas as pd 
import numpy as np

In [49]:
df_titanic=pd.read_csv("./data/titanic-classification.csv")
df_zoo=pd.read_csv("./data/zoo_data-classification.csv")
df_insurance=pd.read_csv("./data/insurance-reggression.csv")
df_salary=pd.read_csv("./data/Salary_Data.csv")

In [50]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [51]:
#cleaning titanic dataset
df_titanic.drop(columns=['PassengerId','Name','Ticket','Cabin'],inplace=True)
df_titanic['Age'].fillna(df_titanic['Age'].median(),inplace=True)
df_titanic['Embarked'].fillna(df_titanic['Embarked'].mode()[0],inplace=True)

C:\Users\mustj\AppData\Local\Temp\ipykernel_4324\2379689717.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_titanic['Age'].fillna(df_titanic['Age'].median(),inplace=True)
C:\Users\mustj\AppData\Local\Temp\ipykernel_4324\2379689717.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_titanic['Embarked'].fillna(df_titanic['Embarked'].mode()[0],inplace=True)

In [52]:
df_titanic.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [53]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
df_titanic['Sex']=le.fit_transform(df_titanic['Sex'])
df_titanic['Embarked']=le.fit_transform(df_titanic['Embarked'])
df_titanic.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

In [54]:
#save titanic data
df_titanic.to_csv("./data/titanic_cleaned.csv",index=False)

In [55]:
#clean insurance dataset
df_insurance.head()

   age     sex   bmi  children smoker     region  expenses
0   19  female  27.9         0    yes  southwest  16884.92
1   18    male  33.8         1     no  southeast   1725.55
2   28    male  33.0         3     no  southeast   4449.46
3   33    male  22.7         0     no  northwest  21984.47
4   32    male  28.9         0     no  northwest   3866.86

In [56]:
df_insurance["sex"]=le.fit_transform(df_insurance["sex"])
df_insurance["smoker"]=le.fit_transform(df_insurance["smoker"])
df_insurance["region"]=le.fit_transform(df_insurance["region"])
df_insurance.head()

   age  sex   bmi  children  smoker  region  expenses
0   19    0  27.9         0       1       3  16884.92
1   18    1  33.8         1       0       2   1725.55
2   28    1  33.0         3       0       2   4449.46
3   33    1  22.7         0       0       1  21984.47
4   32    1  28.9         0       0       1   3866.86

In [57]:
#save insurance data
df_insurance.to_csv("./data/insurance_cleaned.csv",index=False)

In [60]:
#clean webseries dataset
df_salary.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [62]:
df_salary.isna().sum()

YearsExperience    0
Salary             0
dtype: int64